analogdevicesinc/EVAL-ADICUP360/projects/ADuCM360_demo_cn0359_reva/src/applications/message.cpp
/***************************************************************************//**
 *   @file   message.cpp
 *   @brief  Implementation of message.cpp
 *   @author
 *******************************************************************************
 * Copyright 2023(c) Analog Devices, Inc.
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *  - Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *  - Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 *  - Neither the name of Analog Devices, Inc. nor the names of its
 *    contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *  - The use of this software may or may not infringe the patent rights
 *    of one or more patent holders.  This license does not release you
 *    from the requirement that you obtain separate licenses from these
 *    patent holders to use this software.
 *  - Use of the software either in source or binary form, must be run
 *    on or directly connected to an Analog Devices Inc. component.
 *
 * THIS SOFTWARE IS PROVIDED BY ANALOG DEVICES "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, NON-INFRINGEMENT,
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
 * IN NO EVENT SHALL ANALOG DEVICES BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, INTELLECTUAL PROPERTY RIGHTS, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 ******************************************************************************/
#include <ADuCM360.h>
#include <applications/message.h>

#include <list>
#include <cassert>

using namespace std;

list<app> msg_l;

#define MAX_SIZE 32

//ts: thread safe
#define TS_BUF_LEN 16
static struct app ts_msg_buf[TS_BUF_LEN];
static volatile int ts_msg_front = 0, ts_msg_back = 0;

void ts_post_message(struct app &msg)
{
	assert(ts_msg_back != (ts_msg_front - 1));
	assert(!(ts_msg_back == (TS_BUF_LEN - 1) && ts_msg_front == 0));
	assert(msg.argc == 0); // new and delete parameter is not thread safe

	ts_msg_buf[ts_msg_back] = msg;

	if (ts_msg_back == TS_BUF_LEN - 1) {
		ts_msg_back = 0;
	} else {
		++ts_msg_back;
	}
}

void post_message(struct app &msg)
{
	if (msg_l.size() < MAX_SIZE) {
		msg_l.push_back(msg);
	} else {
		assert(false);
	}
}

void execute(struct app application)
{
	(*application.fun)(application.argc, application.argv);

	for (int i = 0; i < application.argc; ++i) {
		delete[] application.argv[i];
	}

	delete application.argv;
}

void message_loop(void)
{
	while (ts_msg_front != ts_msg_back) {
		ts_msg_buf[ts_msg_front].argv = new
		char*; //ts_post_message not thread safe for new

		post_message(ts_msg_buf[ts_msg_front]);

		if (ts_msg_front == TS_BUF_LEN - 1) {
			ts_msg_front = 0;
		} else {
			++ts_msg_front;
		}
	}

	if (!msg_l.empty()) {
		execute(msg_l.front());

		msg_l.pop_front();
	}
}
